Revit 2024 API
FamilyStructuralMaterialTypeFilter.StructuralMaterialType Property
 The family structural material type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public StructuralMaterialType StructuralMaterialType { get; }
Visual Basic
Public ReadOnly Property StructuralMaterialType As StructuralMaterialType
	Get
Visual C++
public:
property StructuralMaterialType StructuralMaterialType {
	StructuralMaterialType get ();
}
See Also
FamilyStructuralMaterialTypeFilter Class
Autodesk.Revit.DB.Structure Namespace